# Oracle SQL Exam - Multiple Choice Questions

This notebook contains multiple choice questions to test your Oracle SQL knowledge.

## Question 1: Basic SELECT Statement

What is the correct syntax to select all columns from a table named `employees`?

**A)** `SELECT * FROM employees;`  
**B)** `SELECT ALL FROM employees;`  
**C)** `SELECT columns FROM employees;`  
**D)** `SELECT * employees;`

In [ ]:
SELECT * FROM employees

## Question 2: WHERE Clause

Which operator is used to check if a value is NULL in Oracle SQL?

**A)** `= NULL`  
**B)** `== NULL`  
**C)** `IS NULL`  
**D)** `EQUALS NULL`

In [ ]:
IS NULL

## Question 3: JOIN Operations

What type of JOIN returns all rows from the left table and matching rows from the right table?

**A)** INNER JOIN  
**B)** LEFT JOIN  
**C)** RIGHT JOIN  
**D)** FULL OUTER JOIN

In [ ]:
LEFT JOIN

## Question 4: Aggregate Functions

Which aggregate function is used to count the number of rows in a result set?

**A)** `SUM()`  
**B)** `COUNT()`  
**C)** `TOTAL()`  
**D)** `NUMBER()`

In [ ]:
COUNT()

## Question 5: GROUP BY and HAVING

What is the difference between WHERE and HAVING clauses?

**A)** WHERE filters rows before grouping, HAVING filters groups after grouping  
**B)** WHERE filters groups, HAVING filters rows  
**C)** They are identical and can be used interchangeably  
**D)** WHERE is used with SELECT, HAVING is used with UPDATE

In [ ]:
WHERE filters rows before grouping ,HAVING filters groups after grouping

## Question 6: Subqueries

Which of the following is a valid use of a subquery?

**A)** `SELECT * FROM (SELECT * FROM employees);`  
**B)** `SELECT * FROM employees WHERE salary > (SELECT AVG(salary) FROM employees);`  
**C)** `SELECT * FROM employees WHERE (SELECT * FROM departments);`  
**D)** Both A and B

In [ ]:
BOTH A and B

## Question 7: String Functions

Which Oracle SQL function is used to concatenate two strings?

**A)** `CONCAT()` or `||`  
**B)** `JOIN()`  
**C)** `MERGE()`  
**D)** `COMBINE()`

In [ ]:
A) CONCAT() or ||

## Question 8: Date Functions

In Oracle SQL, which function returns the current date and time?

**A)** `CURRENT_DATE()`  
**B)** `SYSDATE`  
**C)** `NOW()`  
**D)** `GETDATE()`

In [ ]:
SYSDATE

## Question 9: ORDER BY Clause

What is the default sort order when using ORDER BY in Oracle SQL?

**A)** Descending (DESC)  
**B)** Ascending (ASC)  
**C)** Random  
**D)** No default order

In [ ]:
B) Ascending (ASC)

## Question 10: DISTINCT Keyword

What does the DISTINCT keyword do in a SELECT statement?

**A)** Sorts the results  
**B)** Removes duplicate rows from the result set  
**C)** Filters NULL values  
**D)** Groups the results

In [ ]:
B) Removes duplicate rows from the result set

## Question 11: CASE Statement

Which of the following is the correct syntax for a CASE statement in Oracle SQL?

**A)**
```sql
CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    ELSE result3
END
```

**B)**
```sql
IF condition1 THEN result1
ELSE IF condition2 THEN result2
END IF
```

**C)**
```sql
SWITCH(condition) {
    CASE 1: result1
    CASE 2: result2
}
```

**D)** All of the above

In [ ]:
CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    ELSE result3
END

## Question 12: UNION vs UNION ALL

What is the difference between UNION and UNION ALL?

**A)** UNION removes duplicates, UNION ALL includes all rows including duplicates  
**B)** UNION ALL removes duplicates, UNION includes all rows  
**C)** They are identical  
**D)** UNION is for SELECT, UNION ALL is for INSERT

In [ ]:
 UNION removes duplicates, UNION ALL includes all rows including duplicates

## Question 13: EXISTS Operator

What does the EXISTS operator return?

**A)** The matching rows  
**B)** TRUE if the subquery returns at least one row, FALSE otherwise  
**C)** The count of matching rows  
**D)** An error if no rows are found

In [ ]:
TRUE if the subquery returns at least one row, FALSE otherwise

## Question 14: ROWNUM

In Oracle SQL, what does ROWNUM represent?

**A)** The total number of rows in a table  
**B)** A pseudo-column that assigns a sequential number to each row returned by a query  
**C)** The row number in the physical storage  
**D)** The primary key value

In [ ]:
A pseudo-column that assigns a sequential number to each row returned by a query

## Question 15: Window Functions

Which of the following is a valid window function in Oracle SQL?

**A)** `ROW_NUMBER()`  
**B)** `RANK()`  
**C)** `DENSE_RANK()`  
**D)** All of the above

In [ ]:
All of the above

## Question 16: Correlated Subqueries

What will be the result of the following query if the `employees` table has 100 rows?

```sql
SELECT employee_id, salary
FROM employees e1
WHERE salary > (
    SELECT AVG(salary)
    FROM employees e2
    WHERE e2.department_id = e1.department_id
);
```

**A)** Returns all employees whose salary is greater than the overall average salary  
**B)** Returns all employees whose salary is greater than the average salary in their department  
**C)** Returns an error because correlated subqueries cannot be used in WHERE clause  
**D)** Returns only the first employee from each department

In [ ]:
Returns all employees whose salary is greater than the average salary in their department

## Question 17: Window Functions with PARTITION BY

What does the following query return?

```sql
SELECT employee_id, department_id, salary,
       RANK() OVER (PARTITION BY department_id ORDER BY salary DESC) as rank
FROM employees;
```

**A)** Assigns rank 1 to the highest salary globally  
**B)** Assigns rank 1 to the highest salary within each department  
**C)** Returns an error because RANK() cannot be used with PARTITION BY  
**D)** Returns duplicate ranks for all employees in the same department

In [ ]:
B) Assigns rank 1 to the highest salary within each department

## Question 18: Hierarchical Queries (CONNECT BY)

Which Oracle SQL feature is used to retrieve hierarchical data from a table with parent-child relationships?

**A)** `RECURSIVE WITH` clause  
**B)** `CONNECT BY PRIOR` clause  
**C)** `HIERARCHICAL JOIN`  
**D)** `TREE SELECT` statement

In [ ]:
B) CONNECT BY PRIOR clause

## Question 19: PIVOT Operations

What is the purpose of the PIVOT operator in Oracle SQL?

**A)** To rotate rows into columns  
**B)** To rotate columns into rows  
**C)** To join multiple tables  
**D)** To sort data in ascending order

In [ ]:
A) To rotate rows into columns

## Question 20: Common Table Expressions (CTE)

What is the correct syntax for a Common Table Expression (CTE) in Oracle SQL?

**A)**
```sql
WITH cte_name AS (
    SELECT * FROM employees
)
SELECT * FROM cte_name;
```

**B)**
```sql
CREATE TEMP TABLE cte_name AS (
    SELECT * FROM employees
);
SELECT * FROM cte_name;
```

**C)**
```sql
DECLARE cte_name AS (
    SELECT * FROM employees
);
SELECT * FROM cte_name;
```

**D)** CTEs are not supported in Oracle SQL

In [ ]:
A)

WITH cte_name AS (
    SELECT * FROM employees
)
SELECT * FROM cte_name;

## Question 21: LAG and LEAD Functions

What do the LAG() and LEAD() window functions do in Oracle SQL?

**A)** LAG returns the previous row's value, LEAD returns the next row's value  
**B)** LAG returns the next row's value, LEAD returns the previous row's value  
**C)** Both return the current row's value  
**D)** They are used to calculate running totals

In [ ]:
A) LAG returns the previous row's value, LEAD returns the next row's value

## Question 22: Regular Expressions

Which Oracle SQL function is used to search for patterns using regular expressions?

**A)** `REGEXP_LIKE()`  
**B)** `REGEXP_MATCH()`  
**C)** `PATTERN_MATCH()`  
**D)** `LIKE_REGEX()`

In [ ]:
A) REGEXP_LIKE()

## Question 23: NULL Handling with NVL and COALESCE

What is the difference between NVL() and COALESCE() in Oracle SQL?

**A)** NVL() can handle multiple values, COALESCE() handles only two  
**B)** COALESCE() can handle multiple values, NVL() handles only two  
**C)** They are identical and interchangeable  
**D)** NVL() is ANSI standard, COALESCE() is Oracle-specific

In [ ]:
B) COALESCE() can handle multiple values, NVL() handles only two

## Question 24: MERGE Statement

What is the purpose of the MERGE statement in Oracle SQL?

**A)** To combine two tables into one  
**B)** To perform INSERT, UPDATE, or DELETE operations conditionally based on whether a matching row exists  
**C)** To merge two SELECT statements  
**D)** To combine multiple columns into one

In [ ]:
B) To perform INSERT, UPDATE, or DELETE operations conditionally based on whether a matching row exists

## Question 25: Analytical Functions - FIRST_VALUE and LAST_VALUE

What do FIRST_VALUE() and LAST_VALUE() window functions return?

**A)** The first and last row numbers in the result set  
**B)** The first and last values in an ordered partition  
**C)** The minimum and maximum values in a column  
**D)** The first and last characters of a string

In [ ]:
B) The first and last values in an ordered partition

## Question 26: Multiple Table JOINs

Given three tables: `employees`, `departments`, and `locations`, which query correctly joins all three tables?

**A)**
```sql
SELECT * FROM employees, departments, locations
WHERE employees.dept_id = departments.dept_id
AND departments.loc_id = locations.loc_id;
```

**B)**
```sql
SELECT * FROM employees
JOIN departments ON employees.dept_id = departments.dept_id
JOIN locations ON departments.loc_id = locations.loc_id;
```

**C)** Both A and B are correct  
**D)** Neither A nor B is correct

In [ ]:
C) Both A and B are correct

## Question 27: Date Arithmetic

What will the following query return?

```sql
SELECT SYSDATE + 30 FROM DUAL;
```

**A)** The current date plus 30 days  
**B)** The current date plus 30 months  
**C)** An error because you cannot add numbers to dates  
**D)** The current date plus 30 years

In [ ]:
A) The current date plus 30 days

## Question 28: Self-JOIN

When would you use a self-JOIN in Oracle SQL?

**A)** To join a table with itself to compare rows within the same table  
**B)** To join a table with a backup copy of itself  
**C)** To join a table with a view of itself  
**D)** Self-JOINs are not possible in Oracle SQL

In [ ]:
A) To join a table with itself to compare rows within the same table

## Question 29: INTERSECT and MINUS Operators

What is the difference between INTERSECT and MINUS operators in Oracle SQL?

**A)** INTERSECT returns common rows, MINUS returns rows in first query but not in second  
**B)** INTERSECT returns all rows, MINUS removes duplicates  
**C)** They are identical  
**D)** INTERSECT is for numbers, MINUS is for dates

In [ ]:
A) INTERSECT returns common rows, MINUS returns rows in first query but not in second

## Question 30: DECODE Function

What does the DECODE function do in Oracle SQL?

**A)** Decodes encrypted data  
**B)** Provides IF-THEN-ELSE logic similar to CASE statement  
**C)** Converts binary data to text  
**D)** Decodes URL-encoded strings

In [ ]:
B) Provides IF-THEN-ELSE logic similar to CASE statement

## Question 31: ROWID and ROWNUM

What is the difference between ROWID and ROWNUM in Oracle SQL?

**A)** ROWID is the physical address of a row, ROWNUM is a sequential number assigned to rows  
**B)** ROWNUM is the physical address, ROWID is the sequential number  
**C)** They are identical  
**D)** ROWID is for tables, ROWNUM is for views

In [ ]:
A) ROWID is the physical address of a row, ROWNUM is a sequential number assigned to rows

## Question 32: Aggregate Functions with DISTINCT

What does `COUNT(DISTINCT column_name)` return?

**A)** The total number of rows  
**B)** The number of unique non-NULL values in the column  
**C)** The number of NULL values in the column  
**D)** An error because DISTINCT cannot be used with COUNT

In [ ]:
B) The number of unique non-NULL values in the column

## Question 33: LISTAGG Function

What does the LISTAGG function do in Oracle SQL?

**A)** Lists all aggregate functions available  
**B)** Concatenates values from multiple rows into a single string  
**C)** Creates a list of tables in the database  
**D)** Aggregates list data types

In [ ]:
B) Concatenates values from multiple rows into a single string

## Question 34: CROSS JOIN

What does a CROSS JOIN produce?

**A)** Only matching rows from both tables  
**B)** A Cartesian product (all possible combinations of rows)  
**C)** Only rows from the left table  
**D)** An error because CROSS JOIN is not valid

In [ ]:
B) A Cartesian product (all possible combinations of rows)

# üìò Employees Database ‚Äì Table & Column Dictionary

---

## üßë EMPLOYEES

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| emp_no | INT | Unique identifier for each employee |
| birth_date | DATE | Employee date of birth |
| first_name | VARCHAR | Employee first name |
| last_name | VARCHAR | Employee last name |
| gender | ENUM('M','F') | Employee gender |
| hire_date | DATE | Date the employee was hired |

---

## üè¢ DEPARTMENTS

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| dept_no | CHAR(4) | Unique department identifier |
| dept_name | VARCHAR | Name of the department |

---

## üîó DEPT_EMP (Employee‚ÄìDepartment Mapping)

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| emp_no | INT | Employee ID (FK ‚Üí employees.emp_no) |
| dept_no | CHAR(4) | Department ID (FK ‚Üí departments.dept_no) |
| from_date | DATE | Start date of employee in the department |
| to_date | DATE | End date of employee in the department |

**Purpose:** Tracks department history of employees over time.

---

## üëî DEPT_MANAGER (Department Managers)

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| dept_no | CHAR(4) | Department ID |
| emp_no | INT | Employee ID of the manager |
| from_date | DATE | Manager assignment start date |
| to_date | DATE | Manager assignment end date |

**Purpose:** Maintains historical department manager assignments.

---

## üí∞ SALARIES

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| emp_no | INT | Employee ID |
| salary | INT | Employee salary amount |
| from_date | DATE | Salary effective start date |
| to_date | DATE | Salary effective end date |

**Purpose:** Stores salary history for employees.

---

## üè∑Ô∏è TITLES

| Column Name | Data Type | Meaning |
|------------|----------|--------|
| emp_no | INT | Employee ID |
| title | VARCHAR | Job title of the employee |
| from_date | DATE | Title start date |
| to_date | DATE | Title end date |

**Purpose:** Tracks job title changes over time.

---

## üîπ Row-Level (Single-Row) Function Questions ‚Äì Based on Employees Schema

1. Write a SQL query to display employee first and last names in uppercase.
2. Write a query to extract the year from the `hire_date` of each employee.
3. Write a query to display employee full name by concatenating `first_name` and `last_name`.
4. Write a query to find the length of each employee‚Äôs first name.
5. Write a query to replace the letter 'a' with 'A' in employee last names.
6. Write a query to display employee age using `birth_date`.
7. Write a query to round employee salaries to the nearest thousand.
8. Write a query to display the month name of employee hire dates.
9. Write a query to handle NULL `to_date` values in salary records using `COALESCE`.
10. Write a query to return NULL when `from_date` and `to_date` are the same using `NULLIF`.

---

## üîπ Subquery-Based SQL Questions ‚Äì Based on Employees Schema

11. Write a SQL query to find employees earning more than the average salary.
12. Write a query to list employees who are currently working in the 'Sales' department.
13. Write a query to find employees who have never been managers.
14. Write a query to display employees whose salary is greater than their department‚Äôs average salary.
15. Write a query to find the employee(s) with the maximum salary.
16. Write a query to list departments that have more than one manager.
17. Write a query to find employees who have changed departments at least once.
18. Write a query to list employees whose current title is 'Senior Engineer'.
19. Write a query to find employees who do not have any salary records.
20. Write a query to display employees hired earlier than their managers.

---

## üîπ Important Interview-Level SQL Query Questions ‚Äì Based on Employees Schema

21. Write a query to find the current manager of each department.
22. Write a query to display the current salary of each employee.
23. Write a query to find the top 5 highest-paid employees.
24. Write a query to calculate average salary per department.
25. Write a query to find employees who worked in more than one department.
26. Write a query to display employees with the longest tenure.
27. Write a query to find departments with no employees.
28. Write a query to display salary history for a given employee.
29. Write a query to find employees whose job title has never changed.
30. Write a query to list managers who manage more than 5 employees.